{
  "description": "Mansion In Rittenhouse Square. 8 Bedrooms (7 Queen. 1 King. ). 2 Kitchens. 3 Living Rooms, Library, Roof Deck. This home is a stunner! Built in 1845, and at almost 7,000 sq ft you will go back in time and do it in style. You’ll also enjoy easy access to the best of Philadelphia from this centrally located mansion with Rittenhouse Square two blocks away. The space Step back in time at this exquisite 1845 historic mansion, one of Philadelphia's true architectural gems. With nearly 7,000 sq ft of elegant living space, this grand home offers an unparalleled experience for a festive holiday gathering. It is also a perfect setting for corporate retreats, family reunions, and other special occasions. Perfectly situated just two blocks from the iconic Rittenhouse Square, you are steps away from the city's finest dining, shopping, and cultural landmarks. The space: This is more than a home; it's a journey into history. The moment you enter, you are greeted by the magnificent Grand Parlour—one of the largest private rooms in the city—showcasing original 19th-century details and featuring a pool table and lounge area. Designed to accommodate large groups with ease, the home provides: - Luxury & Privacy: Eight well-appointed bedrooms across five private suites. The Master and Library suites each have a private bathroom, while the other suites share one bathroom between two rooms. - Unrivaled Amenities: Whip up a gourmet meal in our chef's kitchen, complete with stainless steel appliances, a gas range, and all the tools you'll need. With a second, additional kitchen and three living rooms, there's ample space for socializing, dining, and relaxation without ever feeling crowded. - A Rooftop Oasis: Ascend to the stunning roof deck for a truly exclusive experience. Enjoy panoramic city views from a vantage point only available from this location, perfect for morning coffee or sunset cocktails. The house's layout is thoughtfully designed for both togetherness and personal space. The second floor features two luxurious suites, including the expansive Library Suite, which includes a wet bar and a 70-inch 4K TV—often left as a communal space for all to enjoy. The upper floors house an additional kitchen and the remaining suites, providing comfortable and private accommodations for up to 16 guests. Work & Productivity This home is an ideal home base for business travel and team collaboration. Enjoy high-speed Wi-Fi throughout the house and a variety of flexible workspaces, from desks in some suites to communal work areas and comfortable lounges -perfect for breakout sessions or private calls. Guest access You will have exclusive access to the entire 7,000-square-foot mansion, ensuring a completely private and unique experience for you and your guests. Other things to note We have a FIRM NO PARTY POLICY. There are noise and crowd sensors that will sound in the house and also alert management if they detect sustained levels above 79 Decibels. Repeated breaches of the sound levels or unnamed guests on the premises will RESULT IN FULL FORFEITURE OF THE SECURITY DEPOSIT and potentially result in IMMEDIATE EVICTION of the property should the police be called. We expect you to enjoy your time at 1822 Pine, but do so respecting the home and its neighborhood. The house is a piece of history and needs to be treated as such. Thank you :) For those who are interested in hosting dinner parties of 16 or less at the property, please reach out separately for advice or support with making arrangements. We have catering and event organizers that are familiar with the property and can assist in making special occasions - special. All guests assume the risk of injury or loss to person or property in conjunction with the use of the roof deck Registration Details 903781 Show more",
  "location_snippet": "Where you’ll be Philadelphia, Pennsylvania, United States Centered on 19146 Cancel Find a place on the map Find restaurants, landmarks and more. You can add ones you want to visit to the map for reference. Enter a search term and navigate forward to access suggestions. ← Move left → Move right ↑ Move up ↓ Move down + Zoom in - Zoom out Home Jump left by 75% End Jump right by 75% Page Up Jump up by 75% Page Down Jump down by 75% To navigate, press the arrow keys. Verified location Verified location Keyboard shortcuts Map Data Map Data ©2025 Google Map data ©2025 Google 500 m Click to toggle between metric and imperial units Terms Report a map error We verified that this listing’s location is accurate. Learn more Neighborhood highlights New York has the Upper East Side. Chicago has its Gold Coast. Boston has its lower-rise Back Bay. And in Philadelphia, we have Rittenhouse Square. William Penn’s southwest public square has been shorthand for the pinnacle of class and elegance since the mid-19th century, when the city’s elite began building grand houses on the streets west of Broad. As a Rittenhouse resident for your stay, you'll enjoy access to a wealth of arts, culture and intellectual stimulation, as we're wedged between the Avenue of the Arts and the universities across the Schuylkill. Not much further away lie the museums that line the Ben Franklin Parkway. Plus some of the Cities best restaurants are just a stone throw away, from dive bars with superb cuisine at Good Dog to fine dining at Vetri. (Source: PhillMag.com #theysayitbest) The home is also easy walking distance to University City, a stroll to Old Town, and the riverfront is a short car ride away. We suggest a 25 minute walk across town to the world famous Barnes Museum. Show more",
  "amenities": {
    "Core": [
      "What this place offers City skyline view Kitchen Fast wifi – 351 Mbps Dedicated workspace 70 inch HDTV with Netflix Free washer – In unit Free dryer – In unit Central air conditioning Bathtub Exterior security cameras on property Show all 54 amenities"
    ],
    "Kitchen": [],
    "Safety": [],
    "Entertainment": []
  },
  "images": [
    {
      "url": "https://a0.muscache.com/im/pictures/airbnb-platform-assets/AirbnbPlatformAssets-search-bar-icons/original/4aae4ed7-5939-4e76-b100-e69440ebeae4.png",
      "local_path": "1822-pine/images/web/airbnb/airbnb_00.jpg"
    },
    {
      "url": "https://a0.muscache.com/im/pictures/hosting/Hosting-6000930/original/134501cf-9bcf-44c9-8ac1-64add58f958b.jpeg",
      "local_path": "1822-pine/images/web/airbnb/airbnb_01.jpg"
    },
    {
      "url": "https://a0.muscache.com/im/pictures/miso/Hosting-6000930/original/68bd6331-3820-4c06-ad1c-e4922e41bd42.jpeg",
      "local_path": "1822-pine/images/web/airbnb/airbnb_02.jpg"
    },
    {
      "url": "https://a0.muscache.com/im/pictures/miso/Hosting-6000930/original/748c6b9f-2bd5-411c-96ad-05f08272b728.jpeg",
      "local_path": "1822-pine/images/web/airbnb/airbnb_03.jpg"
    },
    {
      "url": "https://a0.muscache.com/im/pictures/miso/Hosting-6000930/original/ba972d1f-61d0-46f5-bc29-e7fa1f3ac1ed.jpeg",
      "local_path": "1822-pine/images/web/airbnb/airbnb_04.jpg"
    },
    {
      "url": "https://a0.muscache.com/im/pictures/miso/Hosting-6000930/original/7d9841a0-68d6-4929-aa53-302089e02c68.jpeg",
      "local_path": "1822-pine/images/web/airbnb/airbnb_05.jpg"
    },
    {
      "url": "https://a0.muscache.com/im/pictures/user/User-31152695/original/dbd06b01-584a-477d-a42a-4d3e6e78acaf.png",
      "local_path": "1822-pine/images/web/airbnb/airbnb_06.jpg"
    },
    {
      "url": "https://a0.muscache.com/im/pictures/hosting/Hosting-6000930/original/bf375547-123c-4362-a6b0-be5111f33e9e.jpeg",
      "local_path": "1822-pine/images/web/airbnb/airbnb_07.jpg"
    }
  ],
  "last_fetched": "2025-08-30T13:12:38Z",
  "source_url": "https://www.airbnb.com/rooms/6000930"
}