[
  {
    "_type": "testimonial",
    "guestName": "Sarah & Michael T.",
    "location": "Boston, MA",
    "date": "2024-10-15",
    "rating": 5,
    "title": "Perfect for Our Family Reunion",
    "review": "We rented the entire mansion for our family reunion (14 people, ages 8-75) and it exceeded every expectation. The space was immaculate, the historic details were breathtaking, and having a full kitchen was essential for our group meals. The Spencer Suite was especially luxurious. Location was perfect - we walked to restaurants, museums, and Rittenhouse Square daily. The host was incredibly responsive and provided excellent recommendations. Worth every penny!",
    "stayDuration": "5 nights",
    "occasion": "Family reunion",
    "helpful": 47,
    "verified": true,
    "featured": true,
    "platform": "Airbnb",
    "response": "Thank you so much, Sarah & Michael! It was our pleasure hosting your wonderful family. We're thrilled the mansion provided the perfect backdrop for your reunion memories. Hope to welcome you back soon!"
  },
  {
    "_type": "testimonial",
    "guestName": "Jennifer L.",
    "location": "San Francisco, CA",
    "date": "2024-09-22",
    "rating": 5,
    "title": "Stunning Property, Incredible History",
    "review": "As a history buff, I was in heaven! Every room tells a story, and the attention to preservation while adding modern amenities is remarkable. The Garden Suite was my favorite - waking up to the courtyard view was magical. The neighborhood is walkable to everything, and the house guidebook had fantastic local recommendations. My only regret is not booking more nights. This is a special place.",
    "stayDuration": "3 nights",
    "occasion": "Solo vacation",
    "helpful": 32,
    "verified": true,
    "featured": true,
    "platform": "VRBO",
    "response": "Jennifer, we're so glad you appreciated the historic details! Preserving the mansion's story while ensuring guest comfort is our passion. Looking forward to your next visit!"
  },
  {
    "_type": "testimonial",
    "guestName": "David & Rebecca K.",
    "location": "Chicago, IL",
    "date": "2024-08-30",
    "rating": 5,
    "title": "Dream Wedding Guest Accommodations",
    "review": "We booked the Rittenhouse Residence to house our out-of-town wedding guests (16 people total). It was the BEST decision. Everyone loved having a 'home base' together instead of separate hotel rooms. The formal dining room was perfect for our rehearsal dinner (catered). The multiple bathrooms meant no morning bottlenecks. The Parlor Suite was elegant for getting ready. Our wedding planner said it's the best guest house she's worked with in Philly. 10/10 recommend for weddings!",
    "stayDuration": "4 nights",
    "occasion": "Wedding accommodation",
    "helpful": 56,
    "verified": true,
    "featured": true,
    "platform": "Airbnb",
    "response": "Congratulations on your wedding! It was an honor to be part of your celebration. The mansion has hosted countless special events over 170 years - we're thrilled to add your love story to its history!"
  },
  {
    "_type": "testimonial",
    "guestName": "Mark R.",
    "location": "New York, NY",
    "date": "2024-11-05",
    "rating": 5,
    "title": "Perfect Corporate Retreat Location",
    "review": "Our startup team (12 people) spent a week here for our annual retreat. The space worked perfectly for both collaborative work sessions and social bonding. We used the dining room for meetings, parlors for breakout groups, and had evening dinners as a team. The high-speed internet was crucial, and having a full kitchen saved us on meal expenses. The historic atmosphere actually sparked great creative conversations. Highly recommend for corporate offsites!",
    "stayDuration": "7 nights",
    "occasion": "Corporate retreat",
    "helpful": 41,
    "verified": true,
    "featured": true,
    "platform": "Direct",
    "response": "Thanks Mark! We love hosting corporate teams and seeing how the historic environment inspires modern creativity. Best wishes for your startup's continued success!"
  },
  {
    "_type": "testimonial",
    "guestName": "Patricia M.",
    "location": "Washington, DC",
    "date": "2024-07-18",
    "rating": 5,
    "title": "Flawless Girls' Weekend",
    "review": "Six college friends, three nights, absolute perfection. We each had our own bedroom (The Tower Rooms and Heritage Quarters were great for our group). The kitchen let us make breakfast together, we walked to incredible restaurants for dinner, and spent evenings in the beautiful parlors catching up. The host left wine and snacks as a welcome gift - such a thoughtful touch! We're already planning our next annual trip here.",
    "stayDuration": "3 nights",
    "occasion": "Friends' getaway",
    "helpful": 28,
    "verified": true,
    "featured": false,
    "platform": "Airbnb",
    "response": "Patricia, so happy you and your friends enjoyed your weekend! The mansion loves bringing people together. Can't wait to host your next reunion!"
  },
  {
    "_type": "testimonial",
    "guestName": "Robert & Linda H.",
    "location": "Atlanta, GA",
    "date": "2024-06-12",
    "rating": 5,
    "title": "Exceeded Our High Expectations",
    "review": "We've stayed in luxury vacation rentals around the world, and this ranks in our top 3. The photos don't do it justice - the craftsmanship, the scale, the preservation quality are all exceptional. We appreciated the detailed house history binder and the stories behind each room. The Garden Suite's private courtyard was our morning coffee spot. Restaurants like Parc and Vernick are a 5-minute walk. Impeccable cleanliness, responsive host, flawless experience.",
    "stayDuration": "4 nights",
    "occasion": "Anniversary trip",
    "helpful": 35,
    "verified": true,
    "featured": true,
    "platform": "VRBO",
    "response": "Robert & Linda, high praise from such well-traveled guests means the world to us! Thank you for appreciating the love and care we put into preserving this historic gem."
  },
  {
    "_type": "testimonial",
    "guestName": "Amanda C.",
    "location": "Los Angeles, CA",
    "date": "2024-10-28",
    "rating": 5,
    "title": "Incredible Photo Shoot Location",
    "review": "I'm a professional photographer and rented this property for a styled shoot. The natural light, architectural details, and variety of rooms provided endless backdrops. Every corner is Instagram-worthy. The host was accommodating with our early check-in needs and provided tips for best lighting times. If you're looking for a stunning location for photos, film, or content creation, this is it!",
    "stayDuration": "2 nights",
    "occasion": "Photo shoot",
    "helpful": 22,
    "verified": true,
    "featured": false,
    "platform": "Direct",
    "response": "Amanda, we loved seeing your beautiful photos! The mansion photographs so well, and we're glad the light and architecture met your professional standards. Hope to host you again!"
  },
  {
    "_type": "testimonial",
    "guestName": "Thomas & Emily B.",
    "location": "Toronto, Canada",
    "date": "2024-09-08",
    "rating": 5,
    "title": "Magical Thanksgiving Stay",
    "review": "We brought our extended family (grandparents, parents, kids - 13 people) for a Philadelphia Thanksgiving. Cooking our family meal in that gorgeous kitchen while the kids played in the parlors was priceless. The formal dining table seated all of us with room to spare. After dinner, we took a family walk to see Rittenhouse Square decorated for the holidays. These are memories we'll cherish forever. Thank you for opening your beautiful home!",
    "stayDuration": "5 nights",
    "occasion": "Thanksgiving holiday",
    "helpful": 39,
    "verified": true,
    "featured": false,
    "platform": "Airbnb",
    "response": "Thomas & Emily, multi-generational gatherings like yours are exactly what this home was built for! So glad we could be part of your family's Thanksgiving tradition."
  },
  {
    "_type": "testimonial",
    "guestName": "Nicole P.",
    "location": "Miami, FL",
    "date": "2024-11-12",
    "rating": 5,
    "title": "Bachelor Party Done Right",
    "review": "We wanted a classy bachelor party experience, not the typical Vegas trip. This mansion delivered! Had 10 guys comfortably (everyone had a real bed, not couches). We hired a chef for dinner one night in the dining room, went out to Center City bars (all walkable), played poker in the parlor, and actually got good sleep in the comfortable beds. The groom's parents even commented on how 'tasteful' our choice was. Perfect blend of fun and class!",
    "stayDuration": "3 nights",
    "occasion": "Bachelor party",
    "helpful": 18,
    "verified": true,
    "featured": false,
    "platform": "VRBO",
    "response": "Nicole, glad we could provide an elevated bachelor party experience! The mansion has definitely seen its share of celebrations over 170 years. Congrats to the groom!"
  },
  {
    "_type": "testimonial",
    "guestName": "Dr. Katherine W.",
    "location": "Baltimore, MD",
    "date": "2024-08-15",
    "rating": 5,
    "title": "Perfect for Medical Conference Group",
    "review": "Our medical practice group (8 doctors) rented this for a conference week at Jefferson Hospital nearby. Much better than a hotel - we could debrief over dinner at the house, prep presentations in the quiet parlors, and actually relax. The walk to Jefferson was under 15 minutes. Having laundry facilities for a week-long stay was essential. The Spencer Suite's workspace was great for reviewing patient files. Professional, comfortable, and surprisingly cost-effective split 8 ways!",
    "stayDuration": "6 nights",
    "occasion": "Medical conference",
    "helpful": 26,
    "verified": true,
    "featured": false,
    "platform": "Direct",
    "response": "Dr. Katherine, thank you for choosing us for your conference housing! We're close to several hospitals and universities, making us a popular choice for medical and academic groups. Safe travels!"
  }
]
